{
  "projectData": [
    {
      "name": "Mosele.Afrika",
      "techStack": [
        "TypeScript",
        "React JS",
        "TailwindCSS",
        "Express",
        "NodeJS",
        "MongoDB",
        "Redux Toolkit",
        "RTK Query",
        "PayFast Integration"
      ],
      "summary": "A platform for South African authors to showcase, crowdfund, and sell books.  This is an MVP that showcases the core features of the platform, including book listings, crowdfunding campaigns, secure payment processing through PayFast and allows the owner to personally update the color theme, main website text and logo. The platform is designed to empower local authors and provide a seamless experience for readers.",
      "responsibilities": [
        "Managed end-to-end project lifecycle including planning, UI/UX design, implementation and testing.",
        "Lead early iterations of the frontend planning phase through effective communication via meetings  and task delegation within the team.",
        "Implemented the frontend using React, TypeScript, and TailwindCSS.",
        "Implemented the backed using NodeJS, Express, and MongoDB.",
        "Implemented state management and API interactions using Redux Toolkit and RTK Query.",
        "Integrated PayFast payment gateway for secure transactions."
      ],
      "website": "https://mosele.vercel.app/",
      "githublink": "",
      "image": "./project-images/mosele/mosele-afrika.webp"
    },
    {
      "name": "The Hive",
      "techStack": [
        "TypeScript",
        "React JS",
        "TailwindCSS",
        "NodeJS",
        "Express",
        "MongoDB",
        "Redux Toolkit",
        "RTK Query"
      ],
      "summary": "The Hive is a full-stack web application designed to facilitate the management of students, mentors and the content associated with them. It allows Mentors to create, read, update and delete Assignments, Curricula, create Students and mark students assignments. Students can view assignments, curricula and mentors and complete their assignments. Demo users: email:mentor@domain.com and password: thehive2025 ; email: karabo.molefe@example.com and password: thehive2025",
      "responsibilities": [
        "Designed the frontend using Figma a design and inspiarations from the internet.",
        "Implemented the UI using React, TypeScript, and TailwindCSS.",
        "Implemented the functionality through Redux Toolkit and RTK Query.",
        "End to end testing of the application",
        "Contributed to the design and implementation of the backend API endpoint"
      ],
      "website": "https://thehive-neon.vercel.app/login",
      "githublink": "",
      "image": "./project-images/intern-hive/media2.webp"
    },
    {
      "name": "Immergence Studios",
      "techStack": ["Typescript", "React JS", "Tailwind CSS"],
      "summary": "This is the official website for Immergence Studios, an animation studio focused on producing world-class animation content. This website represents an exercise in designing, from themes, picking colors to creating an engaing atmosphere.",
      "responsibilities": [
        "I designed the UI/UX.",
        "Picking colors and the theme."
      ],
      "website": "https://immergence-studios-v2.vercel.app/",
      "githublink": "https://github.com/ThembaMtshelwane/immergence-studios-v2",
      "image": "./project-images/immergence-studios/immergence-studios-v2.webp"
    },
    {
      "name": "Aegis Vault",
      "techStack": [
        "React",
        "TypeScript",
        "Redux Toolkit (RTK Query)",
        "Tailwind CSS",
        "Express",
        "MongoDB",
        "Vercel"
      ],
      "summary": "A high-immersion, mystical-themed e-commerce platform designed with a 'Cinzel' and 'Crimson Text' aesthetic. It features a responsive shopping cart and real-time quantity updates.",
      "responsibilities": [
        "Developed a synchronized cart system where UI updates optimistically while syncing with a backend API.",
        "Implemented a 'Mystical Autumn' design system using custom Tailwind CSS utility layers for gradients, glows, and animations.",
        "Built a scalable Express backend with TypeScript, featuring global error handling and modular routing.",
        "Optimized user experience by implementing a custom 'Summoning' loading ritual for initial data fetching and a ScrollToTop utility for seamless navigation.",
        "Deployed a serverless Node.js architecture on Vercel with MongoDB Atlas integration.",
        "TO DO: Implement payment logic, order history and admin pages"
      ],
      "website": "https://aegis-vault-seven.vercel.app/",
      "githublink": "",
      "image": "./project-images/aegis-vault/hero-bg.webp",
      "status": "Deployed"
    }
  ]
}
