{
  "projectData": [
    {
      "name": "Immergence Studios",
      "techStack": ["Typescript", "React JS", "Tailwind CSS"],
      "summary": "This is the official website for Immergence Studios, an animation studio focused on producing world-class animation content. This website represents an exercise in designing, from themes, picking colors to creating an engaing atmosphere.",
      "responsibilities": [
        "I designed the UI/UX.",
        "Picking colors and the theme.",
        "I implemented the music button feature."
      ],
      "website": "https://immergence-studios.vercel.app/",
      "githublink": "https://github.com/ThembaMtshelwane/immergence-studios",
      "image": "./project-images/immergence-studios/immergence-studios.PNG"
    },
    {
      "name": "Dronoticz",
      "techStack": ["React", "Tailwind"],
      "summary": "This project is a Single Page Application. It is a responsive website built using React and TailwindCSS. It is based on a Figma design. The website emphasizes modern web development practices, utilizing Flexbox and the position property to create a dynamic and responsive layout.",
      "responsibilities": [
        "Converting a given Figma design into a website",
        "Responsive web design",
        "Flexbox Layout"
      ],
      "website": "https://dronoticz-projects.vercel.app/",
      "githublink": "https://github.com/ThembaMtshelwane/assignment-1",
      "image": "./project-images/dronoticz/dronoticz1.PNG"
    },
    {
      "name": "Enter-Stream",
      "techStack": ["TypeScript", "React JS", "Tailwind CSS", "JSON Server"],
      "summary": "Enter-Stream is a demo streaming platform website that allows users to view a list of movies and series, as well as add, delete, and edit them. It uses a JSON server thus not fully deployed. More information in the repo.",
      "responsibilities": [
        "CRUD Functionality",
        "Create: Add new movies or series.",
        "Read: View a list of all movies and series",
        "Update: Edit existing movie/series information, including title, image, release year, genre, and country of origin.",
        "Delete: Remove movies or series from the list.",
        "Figma Design: The website was implemented based on a Figma design, reflecting accurate conversion from design to code."
      ],
      "website": "https://enter-stream.vercel.app/",
      "githublink": "https://github.com/ThembaMtshelwane/enter-stream",
      "image": "./project-images/enter-stream/media1.PNG"
    },
    {
      "name": "Exam Prep - Lecturer Website",
      "techStack": [
        "TypeScript",
        "React JS",
        "NextJS",
        "Chakra UI",
        "Firebase"
      ],
      "summary": "A prototype of a full-stack website for lecturers to create and manage quizzes. The quizzes are in a binary tree structure allowing students and lecturers to pinpoint problem areas.",
      "responsibilities": [
        "Create: I developed the create quiz functionality, enabling lecturers to structure quizzes in a binary tree format.",
        "Read and Update: I devised and executed the preview and edit quiz feature, allowing lecturers to review and modify quiz questions.",
        "Delete: I designed and executed the delete quiz feature.",
        "Firebase: Authentication, database storage for files.",
        "I implemented the student data collection feature, facilitating data collection that can also be downloaded in an Excel document.",
        "I implemented responsive web design"
      ],
      "website": "https://exam-prep-roan.vercel.app/",
      "githublink": "https://github.com/ThembaMtshelwane/exam-prep",
      "image": "./project-images/lecturer/lecturer-1.jpg"
    }
  ]
}
